# 4.9_Merging Customer Data

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

## Import customer data

In [4]:
df = pd.read_csv(r'D:\PythonPrjkt\Instacart Basket Analysis\02_Data\2.1_original Data\customers\customers.csv',index_col = False)

In [5]:
df.shape

(206209, 10)

In [6]:
df.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [7]:
df.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

## Let's get rid of personal details

In [8]:
df = df.drop(columns = ['First Name','Surnam'])

In [9]:
df.head()

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
df['Gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: Gender, dtype: int64

In [11]:
df['STATE'].value_counts(dropna = False)

Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: STATE, dtype: int64

In [17]:
df['income'].value_counts(dropna = False)

57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: income, Length: 108012, dtype: int64

In [20]:
#df.rename(columns = {'fam_status' : 'Marital status'},{'n_dependants' : 'Number of dependants'} ,inplace = True)
df.rename(columns = {'n_dependants' : 'Number of dependants'} ,inplace = True)

In [12]:
df.rename(columns = {'n_dependants' : 'Number of dependants'} ,inplace = True)

In [13]:
df.head()

,user_id,Gender,STATE,Age,date_joined,Number of dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [15]:
df.rename(columns = {'fam_status' : 'Marital status'} ,inplace = True)

In [16]:
df.head()

,user_id,Gender,STATE,Age,date_joined,Number of dependants,Marital status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [35]:
df.shape

(206209, 8)

In [18]:
df['user_id'] = df['user_id'].astype('str')

# check for mixed columns

In [19]:
#check mixed type columns
for col in df.columns.tolist():
    weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
if len (df[weird]) > 0:
    print (col)

# find missing values

In [20]:
df.isnull().sum()

user_id                 0
Gender                  0
STATE                   0
Age                     0
date_joined             0
Number of dependants    0
Marital status          0
income                  0
dtype: int64

# find duplicates

In [21]:
dfdups = df[df.duplicated()]

In [22]:
dfdups.shape

(0, 8)

In [23]:
dfdups.head()

Empty DataFrame
Columns: [user_id, Gender, STATE, Age, date_joined, Number of dependants, Marital status, income]
Index: []

In [24]:
#no duplicates found

In [25]:
df_full = pd.read_pickle(r'D:\PythonPrjkt\Instacart Basket Analysis\02_Data\2.7_Prepared data\Ex_8_Client_Query.pkl')

In [26]:
df_full.head()

,Unnamed: 0_x,order_id,user_id,order_number,orders_day_of_week,Order_time_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,aisle_id,department_id,prices,_merge,max_order,loyalty_flag,user_avg_price,spending_habit,median_order_duration,order_frequency
0,42,94891,4,4,5,13,15.0,22199,1,0,...,134,5,8.9,both,4,New customer,8.650000,Lower spender,15.0,Regular customer
1,787017,31925,47329,4,3,10,12.0,22199,1,0,...,134,5,8.9,both,4,New customer,9.200000,Lower spender,12.0,Regular customer
2,42,94891,4,4,5,13,15.0,25146,2,0,...,31,7,8.4,both,4,New customer,8.650000,Lower spender,15.0,Regular customer
3,6612,95113,410,2,1,18,7.0,25146,18,0,...,31,7,8.4,both,28,Regular customer,6.588889,Lower spender,7.0,Frequent customer
4,15832,83780,982,3,0,20,23.0,25146,32,0,...,31,7,8.4,both,6,New customer,7.873913,Lower spender,17.0,Regular customer

In [27]:
df_full.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 290577 entries, 0 to 290576
Data columns (total 22 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   Unnamed: 0_x            290577 non-null  int64
 1   order_id                290577 non-null  int64
 2   user_id                 290577 non-null  int64
 3   order_number            290577 non-null  int64
 4   orders_day_of_week      290577 non-null  int64
 5   Order_time_of_day       290577 non-null  int64
 6   days_since_prior_order  271828 non-null  float64
 7   product_id              290577 non-null  int64
 8   add_to_cart_order       290577 non-null  int64
 9   reordered               290577 non-null  int64
 10  Unnamed: 0_y            290577 non-null  int64
 11  product_name            290577 non-null  object
 12  aisle_id                290577 non-null  int64
 13  department_id           290577 non-null  int64
 14  prices                  290577 non-null  float64
 15  _merge                  290577 non-null  category
 16  max_order               290577 non-null  int64
 17  loyalty_flag            290577 non-null  object
 18  user_avg_price          290577 non-null  float64
 19  spending_habit          290577 non-null  object
 20  median_order_duration   277707 non-null  float64
 21  order_frequency         268181 non-null  object
dtypes: category(1), float64(4), int64(13), object(4)
memory usage: 46.8+ MB

In [28]:
df_full['user_id'] = df_full['user_id'].astype('str')

In [32]:
df_full.rename(columns = {'_merge' : 'previous_merge'} ,inplace = True)

In [33]:
df_final = df_full.merge(df, on = ['user_id'],indicator = True)

In [34]:
df_final.head()

,Unnamed: 0_x,order_id,user_id,order_number,orders_day_of_week,Order_time_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,median_order_duration,order_frequency,Gender,STATE,Age,date_joined,Number of dependants,Marital status,income,_merge
0,42,94891,4,4,5,13,15.0,22199,1,0,...,15.0,Regular customer,Male,Arkansas,31,9/21/2017,3,married,45435,both
1,42,94891,4,4,5,13,15.0,25146,2,0,...,15.0,Regular customer,Male,Arkansas,31,9/21/2017,3,married,45435,both
2,787017,31925,47329,4,3,10,12.0,22199,1,0,...,12.0,Regular customer,Male,Alabama,49,6/25/2017,0,single,159539,both
3,787017,31925,47329,4,3,10,12.0,24968,2,1,...,12.0,Regular customer,Male,Alabama,49,6/25/2017,0,single,159539,both
4,6612,95113,410,2,1,18,7.0,25146,18,0,...,7.0,Frequent customer,Female,Alaska,69,3/17/2020,3,married,73977,both

# check that merge is successful

In [47]:
df_final.shape

(290577, 30)

In [51]:
df_final['_merge'].value_counts(dropna = False)

both          290577
left_only          0
right_only         0
Name: _merge, dtype: int64

# export as a pickle file

In [54]:
df_final.to_pickle(r'D:\PythonPrjkt\Instacart Basket Analysis\02_Data\2.7_Prepared data\4.9_final_data_from_part_01.pkl')

# part one concluded

In [36]:
OPP = pd.read_csv(r'D:\PythonPrjkt\Instacart Basket Analysis\02_Data\2.1_original Data\order_products__prior.csv',index_col = False)

In [38]:
OPP.shape

(32434489, 4)

### contents
### pkl file
### pkl file export